html/haskell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-02 Sat 22:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Haskell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
</head>
<body>
<div id="content">
<h1 class="title">Haskell</h1>

<div id="outline-container-org4e34e97" class="outline-2">
<h2 id="org4e34e97"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd9af7b0" class="outline-3">
<h3 id="orgd9af7b0"><span class="section-number-3">1.1</span> Expressions</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Expressions include concrete values, variables, and also functions</li>
<li>Functions are expressions that are applied to an argument, and hence
can be <i>reduced</i> or <i>evaluated</i></li>
</ul>
</div>
</div>
<div id="outline-container-org8a4a48a" class="outline-3">
<h3 id="org8a4a48a"><span class="section-number-3">1.2</span> Infix/Prefix</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-text">div (prefix) -&gt; `div` (infix)
+ (infix) -&gt; (+) (prefix)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb400879" class="outline-3">
<h3 id="orgb400879"><span class="section-number-3">1.3</span> Let vs Where</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Let introduces an expression, so it can be used wherever you can have
an expression, but where is a declaration and is bound to a
surrounding syntactic construct.
</p>
</div>
</div>
<div id="outline-container-org5bd04a2" class="outline-3">
<h3 id="org5bd04a2"><span class="section-number-3">1.4</span> Typeclasses</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Typeclasses are a way of adding additional functionality that is
reusable across all the types that have instances of that typeclass.
<code>Num</code> is a typeclass for most numeric types, that provide the basic
operators <code>(+)</code>, <code>(-)</code>, <code>(*)</code> , <code>(/)</code> etc.
</p>
</div>
</div>
<div id="outline-container-org310495c" class="outline-3">
<h3 id="org310495c"><span class="section-number-3">1.5</span> Datatype declaration</h3>
<div class="outline-text-3" id="text-1-5">
<p>
A datatype declaration defines a type constructor and data
constructors. Data constructors are the values of a particular type,
and are also functions that let us create data, or values, of a
particular type.
</p>
</div>
</div>
<div id="outline-container-orgeb33fe4" class="outline-3">
<h3 id="orgeb33fe4"><span class="section-number-3">1.6</span> Sectioning</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Refers to the partial application of infix operators.
</p>
<div class="org-src-container">
<pre class="src src-haskell">let x = 5
let y = (2^)
let z = (^2)

y x                             -- 32
z x                             -- 25

let celebrate = (++ " woot!")
celebrate "naptime" -- "naptime woot!"
celebrate "dogs" -- "dogs woot!"
</pre>
</div>
</div>
</div>
<div id="outline-container-orgefec0ed" class="outline-3">
<h3 id="orgefec0ed"><span class="section-number-3">1.7</span> Types</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgcae7f57" class="outline-4">
<h4 id="orgcae7f57"><span class="section-number-4">1.7.1</span> Polymorphism</h4>
<div class="outline-text-4" id="text-1-7-1">
<ol class="org-ol">
<li>Parametric polymorphism
<ul class="org-ul">
<li>Refers to type variables, or parameters, that are fully
polymorphic</li>
<li>When unconstrained by a typeclass, the final concrete type could
be anything</li>
</ul></li>
<li>Constrained polymorphism
<ul class="org-ul">
<li>Puts typeclass constraints on the variable, decreasing the number
of concrete types it could be, but increasing what you can
actually do with it by defining and bringing into scope a set of
operations</li>
</ul></li>
</ol>

<p>
Numeric literals are polymorphic and stay so until given a more
specific type.
</p>
</div>
</div>
<div id="outline-container-org3ba6172" class="outline-4">
<h4 id="org3ba6172"><span class="section-number-4">1.7.2</span> Parametricity</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
<i>parametricity</i> means that the behaviour of a function with respect to
the types its (parametric polymorphic) arguments is uniform. The
behaviour cannot change just because it was applied to an argument of
a different type.
</p>
</div>
</div>
<div id="outline-container-org6dae975" class="outline-4">
<h4 id="org6dae975"><span class="section-number-4">1.7.3</span> Making things more polymorphic</h4>
<div class="outline-text-4" id="text-1-7-3">
<div class="org-src-container">
<pre class="src src-haskell">-- fromIntegral :: (Num b, Integral a) =&gt; a -&gt; b
-- e.g.
6 / fromIntegral (length [1,2,3])
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb35e1a5" class="outline-2">
<h2 id="orgb35e1a5"><span class="section-number-2">2</span> Laziness and Performance</h2>
<div class="outline-text-2" id="text-2">
<p>
Laziness can be a useful tool for improving performance, but more
often than not it reduces performance by adding a constant overhead to
everything. Because of laziness, the compiler can't evaluate a
function argument and pass the value to the function, it has to record
the expression in the heap in a suspension (or thunk) in case it is
evaluated later. Storing and evaluating suspensions is costly, and
unnecessary if the expression was going to be evaluated anyway.
</p>

<p>
One can force eager evaluation by prepending a bang(<code>!</code>) in front of
the expression.
</p>
</div>
</div>
<div id="outline-container-org46df382" class="outline-2">
<h2 id="org46df382"><span class="section-number-2">3</span> Typeclasses</h2>
<div class="outline-text-2" id="text-3">
<p>
Where a declaration of a type defines how that particular type is
created, a declaration of a typeclass defines how a set of types are
consumed or used in computations.
</p>

<p>
As long as a type implements, or instantiates a typeclass, then
standard functions implemented on the typeclass can be used.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data DayOfWeek =
  Mon | Tue | Wed | Thu | Fri | Sat | Sun

-- day of week and numerical day of month

data Date =
  Date DayOfWeek Int
</pre>
</div>

<p>
Because Eq is not derived in the typeclass, we need to instantiate one
of our own:
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Eq DayOfWeek where
  (==) Mon Mon = True
  (==) Tue Tue = True
  (==) Wed Wed = True
  (==) Thu Thu = True
  (==) Fri Fri = True
  (==) Sat Sat = True
  (==) Sun Sun = True
  (==) _ _ = False

instance Eq Date where
  (==) (Date weekday dayOfMonth) (Date weekday' dayOfMonth') =
    weekday == weekday' &amp;&amp; dayOfMonth = dayOfMonth'
</pre>
</div>

<p>
Typeclass instances are unique parings of the typeclass and a type.
They define the ways to implement the typeclass methods for that type.
</p>
</div>
