haskell.org
** IO
An IO action is an action that, when performed, has side effects,
including reading from input and printing to the screen, and will
contain a return value.

In =IO ()=, =()= denotes an empty tuple, referred to as a /unit/. A
unit is both a value and a type, that has only one inhabitant.

** Summary
- A typeclass defines a set of functions and/or values;
- Types have instances of that typeclass
- The instances specify the ways that type uses the functions of the typeclass
* Lists
#+BEGIN_SRC haskell
  data [] a = [] | a : [a]
#+END_SRC
** Extracting portions of lists
#+BEGIN_SRC haskell
  take :: Int -> [a] -> [a]
  drop :: Int -> [a] -> [a]
  splitAt :: Int -> [a] -> ([a], [a])
#+END_SRC

#+BEGIN_SRC haskell
  takeWhile :: (a -> Bool) -> [a] -> [a]
  dropWhile :: (a -> Bool) -> [a] -> [a]
#+END_SRC
** Transforming lists of values
#+BEGIN_SRC haskell
  map :: (a -> b) -> [a] -> [b]
  fmap :: Functor f => (a -> b) -> f a -> f b
#+END_SRC

#+BEGIN_SRC haskell
  map (+1) [1,2,3,4] -- [2,3,4,5]
  map (1-) [1,2,3,4] -- [0,-1,-2,-3]
#+END_SRC

#+BEGIN_SRC haskell
  filter :: (a -> Bool) -> [a] -> [a]
  filter _ [] = []
  filter pred (x:xs)
    | pred x = x : filter pred xs
    | otherwise = filter pred xs
#+END_SRC

#+BEGIN_SRC haskell
  zip :: [a] -> [b] -> [(a,b)]
  zip [1,2] [3,4] -- [(1,3), (2,4)]

  zipWith (+) [1,2,3] [10,11,12] -- [11,13,15]
#+END_SRC
** Folding lists
   Folds as a general concept are called /catamorphisms/.
   /Catamorphisms/ are a means of deconstructing data. If the spine of
   the list is the structure of a list, then a fold is what can reduce
   that structure.

#+BEGIN_SRC haskell
  foldr :: (a -> b -> b) -> b -> [a] -> b
  foldr f z xs =
    case xs of
      [] -> z
      (x:xs) -> f x (foldr f z xs)
#+END_SRC
* Algebraic Datatypes
A type can be thought of as an enumeration of constructors that have
zero or more arguments.

Haskell offers sum types, product types, product types with record
syntax, type aliases, and a special datatype called a newtype that
offers a different set of options and constraints from either type
synonyms or data declarations.

#+BEGIN_SRC haskell
    data Bool = False | True
  -- [1] [2] [3] [4] [5] [6]

    data [] a = [] | a : [a]
  --     [7]   [8]    [9]
#+END_SRC

1. Keyword /data/ to signal that what follows is a data declaration,
   or a declaration of a datatype
2. Type constructor (with no arguments)
3. Equals sign divides the type constructor from the data constructor
4. Data constructor. In this case, a data constructor that takes no
   arguments, so is called a /nullary/ constructor.
5. Pipe denotes a sum type, which indicates a logical disjunction
   (colloquially /or/) in what values can have that type
6. Constructor for the value True, another nullary constructor
7. Type constructor with an argument. The argument is a polymorphic
   type variable, so the list's argument can be of different types
8. Data constructor for the empty list
9. Data constructor that takes two arguments, an a and also a [a]
** Data and type constructors
Type constructors are used only at the type level, in type signatures
and typeclass declarations and instances. Types are static and resolve
at compile time.

Data constructors construct the values at term level, values you can
interact with at runtime.

Type and data constructors that take no arguments are constants. They
can only store a fixed type and amount of data.
** Type constructors and kinds
Kinds are types of types, or types one level up. We represent kinds in
Haskell with =*=. We know something is a fully applied, concrete type
when it is represented as =*=. When it is =* -> *=, it is still
waiting to be applied.

#+BEGIN_SRC haskell
  -- :k Bool
  Bool :: *

  -- :k [Int]
  [Int] :: *

  -- :k []
  [] :: * -> *
#+END_SRC


Both =Bool= and [Int] are fully applied, concrete types, so their kind
signatures have no function arrows.
** Types vs Data
When data constructors take arguments, those arguments refer to other
types.

#+BEGIN_SRC haskell
  data Price =
    --  (a)
    Price Integer deriving (Eq, Show)
  -- (b)  [1]
  -- type constructor a
  -- data constructor b
  -- type argument [1]
#+END_SRC
