html/haskell.html

<div id="outline-container-orgca636e1" class="outline-3">
<h3 id="orgca636e1"><span class="section-number-3">3.1</span> IO</h3>
<div class="outline-text-3" id="text-3-1">
<p>
An IO action is an action that, when performed, has side effects,
including reading from input and printing to the screen, and will
contain a return value.
</p>

<p>
In <code>IO ()</code>, <code>()</code> denotes an empty tuple, referred to as a <i>unit</i>. A
unit is both a value and a type, that has only one inhabitant.
</p>
</div>
</div>

<div id="outline-container-org9317f53" class="outline-3">
<h3 id="org9317f53"><span class="section-number-3">3.2</span> Summary</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>A typeclass defines a set of functions and/or values;</li>
<li>Types have instances of that typeclass</li>
<li>The instances specify the ways that type uses the functions of the typeclass</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc7aadf4" class="outline-2">
<h2 id="orgc7aadf4"><span class="section-number-2">4</span> Lists</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-haskell">data [] a = [] | a : [a]
</pre>
</div>
</div>
<div id="outline-container-orga885663" class="outline-3">
<h3 id="orga885663"><span class="section-number-3">4.1</span> Extracting portions of lists</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-haskell">take :: Int -&gt; [a] -&gt; [a]
drop :: Int -&gt; [a] -&gt; [a]
splitAt :: Int -&gt; [a] -&gt; ([a], [a])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">takeWhile :: (a -&gt; Bool) -&gt; [a] -&gt; [a]
dropWhile :: (a -&gt; Bool) -&gt; [a] -&gt; [a]
</pre>
</div>
</div>
</div>
<div id="outline-container-org15ff6ee" class="outline-3">
<h3 id="org15ff6ee"><span class="section-number-3">4.2</span> Transforming lists of values</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-haskell">map :: (a -&gt; b) -&gt; [a] -&gt; [b]
fmap :: Functor f =&gt; (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">map (+1) [1,2,3,4] -- [2,3,4,5]
map (1-) [1,2,3,4] -- [0,-1,-2,-3]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">filter :: (a -&gt; Bool) -&gt; [a] -&gt; [a]
filter _ [] = []
filter pred (x:xs)
  | pred x = x : filter pred xs
  | otherwise = filter pred xs
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">zip :: [a] -&gt; [b] -&gt; [(a,b)]
zip [1,2] [3,4] -- [(1,3), (2,4)]

zipWith (+) [1,2,3] [10,11,12] -- [11,13,15]
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b3700e" class="outline-3">
<h3 id="org7b3700e"><span class="section-number-3">4.3</span> Folding lists</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Folds as a general concept are called <i>catamorphisms</i>.
<i>Catamorphisms</i> are a means of deconstructing data. If the spine of
the list is the structure of a list, then a fold is what can reduce
that structure.
</p>

<div class="org-src-container">
<pre class="src src-haskell">foldr :: (a -&gt; b -&gt; b) -&gt; b -&gt; [a] -&gt; b
foldr f z xs =
  case xs of
    [] -&gt; z
    (x:xs) -&gt; f x (foldr f z xs)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge56e2a3" class="outline-2">
<h2 id="orge56e2a3"><span class="section-number-2">5</span> Algebraic Datatypes</h2>
<div class="outline-text-2" id="text-5">
<p>
A type can be thought of as an enumeration of constructors that have
zero or more arguments.
</p>

<p>
Haskell offers sum types, product types, product types with record
syntax, type aliases, and a special datatype called a newtype that
offers a different set of options and constraints from either type
synonyms or data declarations.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  data Bool = False | True
-- [1] [2] [3] [4] [5] [6]

  data [] a = [] | a : [a]
--     [7]   [8]    [9]
</pre>
</div>

<ol class="org-ol">
<li>Keyword <i>data</i> to signal that what follows is a data declaration,
or a declaration of a datatype</li>
<li>Type constructor (with no arguments)</li>
<li>Equals sign divides the type constructor from the data constructor</li>
<li>Data constructor. In this case, a data constructor that takes no
arguments, so is called a <i>nullary</i> constructor.</li>
<li>Pipe denotes a sum type, which indicates a logical disjunction
(colloquially <i>or</i>) in what values can have that type</li>
<li>Constructor for the value True, another nullary constructor</li>
<li>Type constructor with an argument. The argument is a polymorphic
type variable, so the list's argument can be of different types</li>
<li>Data constructor for the empty list</li>
<li>Data constructor that takes two arguments, an a and also a [a]</li>
</ol>
</div>
<div id="outline-container-org664b32b" class="outline-3">
<h3 id="org664b32b"><span class="section-number-3">5.1</span> Data and type constructors</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Type constructors are used only at the type level, in type signatures
and typeclass declarations and instances. Types are static and resolve
at compile time.
</p>

<p>
Data constructors construct the values at term level, values you can
interact with at runtime.
</p>

<p>
Type and data constructors that take no arguments are constants. They
can only store a fixed type and amount of data.
</p>
</div>
</div>
<div id="outline-container-org768381d" class="outline-3">
<h3 id="org768381d"><span class="section-number-3">5.2</span> Type constructors and kinds</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Kinds are types of types, or types one level up. We represent kinds in
Haskell with <code>*</code>. We know something is a fully applied, concrete type
when it is represented as <code>*</code>. When it is <code>* -&gt; *</code>, it is still
waiting to be applied.
</p>

<div class="org-src-container">
<pre class="src src-haskell">-- :k Bool
Bool :: *

-- :k [Int]
[Int] :: *

-- :k []
[] :: * -&gt; *
</pre>
</div>


<p>
Both <code>Bool</code> and [Int] are fully applied, concrete types, so their kind
signatures have no function arrows.
</p>
</div>
</div>
<div id="outline-container-orgcc6f5f1" class="outline-3">
<h3 id="orgcc6f5f1"><span class="section-number-3">5.3</span> Types vs Data</h3>
<div class="outline-text-3" id="text-5-3">
<p>
When data constructors take arguments, those arguments refer to other
types.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Price =
  --  (a)
  Price Integer deriving (Eq, Show)
-- (b)  [1]
-- type constructor a
-- data constructor b
-- type argument [1]
</pre>
</div>
</div>
</div>
