content/zettels/haskell.md


### IO {#io}

An IO action is an action that, when performed, has side effects,
including reading from input and printing to the screen, and will
contain a return value.

In `IO ()`, `()` denotes an empty tuple, referred to as a _unit_. A
unit is both a value and a type, that has only one inhabitant.


### Summary {#summary}

-   A typeclass defines a set of functions and/or values;
-   Types have instances of that typeclass
-   The instances specify the ways that type uses the functions of the typeclass


## Lists {#lists}

```haskell
data [] a = [] | a : [a]
```


### Extracting portions of lists {#extracting-portions-of-lists}

```haskell
take :: Int -> [a] -> [a]
drop :: Int -> [a] -> [a]
splitAt :: Int -> [a] -> ([a], [a])
```

```haskell
takeWhile :: (a -> Bool) -> [a] -> [a]
dropWhile :: (a -> Bool) -> [a] -> [a]
```


### Transforming lists of values {#transforming-lists-of-values}

```haskell
map :: (a -> b) -> [a] -> [b]
fmap :: Functor f => (a -> b) -> f a -> f b
```

```haskell
map (+1) [1,2,3,4] -- [2,3,4,5]
map (1-) [1,2,3,4] -- [0,-1,-2,-3]
```

```haskell
filter :: (a -> Bool) -> [a] -> [a]
filter _ [] = []
filter pred (x:xs)
  | pred x = x : filter pred xs
  | otherwise = filter pred xs
```

```haskell
zip :: [a] -> [b] -> [(a,b)]
zip [1,2] [3,4] -- [(1,3), (2,4)]

zipWith (+) [1,2,3] [10,11,12] -- [11,13,15]
```


### Folding lists {#folding-lists}

Folds as a general concept are called _catamorphisms_.
_Catamorphisms_ are a means of deconstructing data. If the spine of
the list is the structure of a list, then a fold is what can reduce
that structure.

```haskell
foldr :: (a -> b -> b) -> b -> [a] -> b
foldr f z xs =
  case xs of
    [] -> z
    (x:xs) -> f x (foldr f z xs)
```


## Algebraic Datatypes {#algebraic-datatypes}

A type can be thought of as an enumeration of constructors that have
zero or more arguments.

Haskell offers sum types, product types, product types with record
syntax, type aliases, and a special datatype called a newtype that
offers a different set of options and constraints from either type
synonyms or data declarations.

```haskell
  data Bool = False | True
-- [1] [2] [3] [4] [5] [6]

  data [] a = [] | a : [a]
--     [7]   [8]    [9]
```

1.  Keyword _data_ to signal that what follows is a data declaration,
    or a declaration of a datatype
2.  Type constructor (with no arguments)
3.  Equals sign divides the type constructor from the data constructor
4.  Data constructor. In this case, a data constructor that takes no
    arguments, so is called a _nullary_ constructor.
5.  Pipe denotes a sum type, which indicates a logical disjunction
    (colloquially _or_) in what values can have that type
6.  Constructor for the value True, another nullary constructor
7.  Type constructor with an argument. The argument is a polymorphic
    type variable, so the list's argument can be of different types
8.  Data constructor for the empty list
9.  Data constructor that takes two arguments, an a and also a [a]


### Data and type constructors {#data-and-type-constructors}

Type constructors are used only at the type level, in type signatures
and typeclass declarations and instances. Types are static and resolve
at compile time.

Data constructors construct the values at term level, values you can
interact with at runtime.

Type and data constructors that take no arguments are constants. They
can only store a fixed type and amount of data.


### Type constructors and kinds {#type-constructors-and-kinds}

Kinds are types of types, or types one level up. We represent kinds in
Haskell with `*`. We know something is a fully applied, concrete type
when it is represented as `*`. When it is `* -> *`, it is still
waiting to be applied.

```haskell
-- :k Bool
Bool :: *

-- :k [Int]
[Int] :: *

-- :k []
[] :: * -> *
```

Both `Bool` and [Int] are fully applied, concrete types, so their kind
signatures have no function arrows.


### Types vs Data {#types-vs-data}

When data constructors take arguments, those arguments refer to other
types.

```haskell
data Price =
  --  (a)
  Price Integer deriving (Eq, Show)
-- (b)  [1]
-- type constructor a
-- data constructor b
-- type argument [1]
```
