haskell.org
** What makes these datatypes algebraic?
Algebraic datatypes are so, because we can describe the patterns of
argument structures using two basic operations: sum and product.

The cardinality of a datatype is the number of possible values it
defines. Knowing how many possible values inhabit a type can help
reason about programs.

The cardinality of =Bool= is 2, only being to take on =True= or =False=.

Datatypes that only contains a unary constructor always have the same
cardinality as the type they contain.

#+BEGIN_SRC haskell
  data Goats = Goats Int deriving (Eq, Show)
#+END_SRC

Here, =Goats= has the cardinality of =Int=.
** Sum Types
Cardinality is obtained through summation. Example, Bool:
#+BEGIN_SRC haskell
  data Bool = True | False
#+END_SRC

In this case, the cardinality of =Bool= is the sum of the cardinality
of =True= and =False=.
** Record syntax
#+BEGIN_SRC haskell
  data Person =
    Person { name :: String
           , age :: Int }
           deriving (Eq, Show)
#+END_SRC
* Signaling Adversity
** Maybe
#+BEGIN_SRC haskell
  data Maybe = Just a | Nothing
#+END_SRC
#+BEGIN_SRC haskell
  type Name = String
  type Age = Integer

  data Person = Person Name Age Deriving (Eq, Show)

  mkPerson :: Name -> Age -> Maybe Person
  mkPerson name age
    | name /= "" && age >=0 = Just $ Person name age
    | otherwise = Nothing
#+END_SRC

mkPerson is a /smart constructor/. It allows us to construct values
only if it meets a certain criteria.
** Either
We use an =either= to figure out which criteria is not met:
#+BEGIN_SRC haskell
  data Either a b = Left a | Right b
#+END_SRC

#+BEGIN_SRC haskell
  data Person Invalid = NameEmpty | AgeTooLow deriving (Eq, Show)

  mkPerson :: Name -> Age -> Either PersonInvalid Person
  mkPerson name age
    | name /= "" && age >=0 - Right $ Person name age
    | name == "" = Left PersonInvalid
    | otherwise = Left AgeTooLow
#+END_SRC

=Left= is used as the invalid or error constructor. =Functor= will not
map over the left type argument because it has been applied away.
*** Signalling Multiple errors
#+BEGIN_SRC haskell
  type Name = String
  type Age = Integer
  type ValidatePerson a = Either [PersonInvalid] a

  data Person = Person Name Age deriving Show

  data PersonInvalid = NameEmpty | AgeTooLow deriving (Eq, Show)

  ageOkay :: Age -> Either [PersonInvalid] Age
  ageOkay age = case age >= 0 of
    True -> Right age
    False -> Left [AgeTooLow]

  nameOkay :: Name -> Either [PersonInvalid] Name
  nameOkay name = case name == "" of
    True -> Left [NameEmpty]
    False -> Right name

  mkPerson :: Name -> Age -> ValidatePerson Person
  mkPerson name age =
    mkPerson' (nameOkay name) (ageOkay age)

  mkPerson' :: ValidatePerson Name
            -> ValidatePerson Age
            -> ValidatePerson Person

  mkPerson' (Right nameOk) (Right ageOk) = Right (Person nameOk ageOk)
  mkPerson' (Left badName) (Left badAge) = Left (badName ++ badAge)
  mkPerson' (Left badName) _ = Left badName
  mkPerson' _ (Left badAge) = Left badAge
#+END_SRC
** Anamorphisms
/Anamorphisms/ are the dual of /catamorphisms/. Catamorphisms, or
folds, break data structures down, anamorphisms builds up data
structures.

#+BEGIN_SRC haskell
  -- iterate is like a very limited unfold that never ends
  iterate :: (a -> a) -> a -> [a]

  take 10 $ iterate (+1) 0
  [0,1,2,3,4,5,6,7,8,9]

  --unfoldr is more general
  unfoldr :: (b -> Maybe (a,b)) -> b -> [a]

  take 10 $ unfoldr (\b -> Just (b, b+1)) 0
  [0,1,2,3,4,5,6,7,8,9]
#+END_SRC
