html/haskell.html
<div id="outline-container-org6adb209" class="outline-3">
<h3 id="org6adb209"><span class="section-number-3">5.4</span> What makes these datatypes algebraic?</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Algebraic datatypes are so, because we can describe the patterns of
argument structures using two basic operations: sum and product.
</p>

<p>
The cardinality of a datatype is the number of possible values it
defines. Knowing how many possible values inhabit a type can help
reason about programs.
</p>

<p>
The cardinality of <code>Bool</code> is 2, only being to take on <code>True</code> or <code>False</code>.
</p>

<p>
Datatypes that only contains a unary constructor always have the same
cardinality as the type they contain.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Goats = Goats Int deriving (Eq, Show)
</pre>
</div>

<p>
Here, <code>Goats</code> has the cardinality of <code>Int</code>.
</p>
</div>
</div>
<div id="outline-container-orgeee5992" class="outline-3">
<h3 id="orgeee5992"><span class="section-number-3">5.5</span> Sum Types</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Cardinality is obtained through summation. Example, Bool:
</p>
<div class="org-src-container">
<pre class="src src-haskell">data Bool = True | False
</pre>
</div>

<p>
In this case, the cardinality of <code>Bool</code> is the sum of the cardinality
of <code>True</code> and <code>False</code>.
</p>
</div>
</div>
<div id="outline-container-org7313f9c" class="outline-3">
<h3 id="org7313f9c"><span class="section-number-3">5.6</span> Record syntax</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-haskell">data Person =
  Person { name :: String
         , age :: Int }
         deriving (Eq, Show)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1678d4a" class="outline-2">
<h2 id="org1678d4a"><span class="section-number-2">6</span> Signaling Adversity</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc9c7c58" class="outline-3">
<h3 id="orgc9c7c58"><span class="section-number-3">6.1</span> Maybe</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-haskell">data Maybe = Just a | Nothing
</pre>
</div>
<div class="org-src-container">
<pre class="src src-haskell">type Name = String
type Age = Integer

data Person = Person Name Age Deriving (Eq, Show)

mkPerson :: Name -&gt; Age -&gt; Maybe Person
mkPerson name age
  | name /= "" &amp;&amp; age &gt;=0 = Just $ Person name age
  | otherwise = Nothing
</pre>
</div>

<p>
mkPerson is a <i>smart constructor</i>. It allows us to construct values
only if it meets a certain criteria.
</p>
</div>
</div>
<div id="outline-container-orgb8198e8" class="outline-3">
<h3 id="orgb8198e8"><span class="section-number-3">6.2</span> Either</h3>
<div class="outline-text-3" id="text-6-2">
<p>
We use an <code>either</code> to figure out which criteria is not met:
</p>
<div class="org-src-container">
<pre class="src src-haskell">data Either a b = Left a | Right b
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">data Person Invalid = NameEmpty | AgeTooLow deriving (Eq, Show)

mkPerson :: Name -&gt; Age -&gt; Either PersonInvalid Person
mkPerson name age
  | name /= "" &amp;&amp; age &gt;=0 - Right $ Person name age
  | name == "" = Left PersonInvalid
  | otherwise = Left AgeTooLow
</pre>
</div>

<p>
<code>Left</code> is used as the invalid or error constructor. <code>Functor</code> will not
map over the left type argument because it has been applied away.
</p>
</div>
<div id="outline-container-org25dc418" class="outline-4">
<h4 id="org25dc418"><span class="section-number-4">6.2.1</span> Signalling Multiple errors</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">
<pre class="src src-haskell">type Name = String
type Age = Integer
type ValidatePerson a = Either [PersonInvalid] a

data Person = Person Name Age deriving Show

data PersonInvalid = NameEmpty | AgeTooLow deriving (Eq, Show)

ageOkay :: Age -&gt; Either [PersonInvalid] Age
ageOkay age = case age &gt;= 0 of
  True -&gt; Right age
  False -&gt; Left [AgeTooLow]

nameOkay :: Name -&gt; Either [PersonInvalid] Name
nameOkay name = case name == "" of
  True -&gt; Left [NameEmpty]
  False -&gt; Right name

mkPerson :: Name -&gt; Age -&gt; ValidatePerson Person
mkPerson name age =
  mkPerson' (nameOkay name) (ageOkay age)

mkPerson' :: ValidatePerson Name
          -&gt; ValidatePerson Age
          -&gt; ValidatePerson Person

mkPerson' (Right nameOk) (Right ageOk) = Right (Person nameOk ageOk)
mkPerson' (Left badName) (Left badAge) = Left (badName ++ badAge)
mkPerson' (Left badName) _ = Left badName
mkPerson' _ (Left badAge) = Left badAge
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org65d4ad2" class="outline-3">
<h3 id="org65d4ad2"><span class="section-number-3">6.3</span> Anamorphisms</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<i>Anamorphisms</i> are the dual of <i>catamorphisms</i>. Catamorphisms, or
folds, break data structures down, anamorphisms builds up data
structures.
</p>

<div class="org-src-container">
<pre class="src src-haskell">-- iterate is like a very limited unfold that never ends
iterate :: (a -&gt; a) -&gt; a -&gt; [a]

take 10 $ iterate (+1) 0
[0,1,2,3,4,5,6,7,8,9]

--unfoldr is more general
unfoldr :: (b -&gt; Maybe (a,b)) -&gt; b -&gt; [a]

take 10 $ unfoldr (\b -&gt; Just (b, b+1)) 0
[0,1,2,3,4,5,6,7,8,9]
</pre>
</div>
</div>
</div>
</div>
