html/haskell.html
<div id="outline-container-orgc1dbf85" class="outline-2">
<h2 id="orgc1dbf85"><span class="section-number-2">7</span> Monoids</h2>
<div class="outline-text-2" id="text-7">
<p>
In Haskell, algebras are implemented with typeclasses; the typeclasses
define the set of operations. When we talk about operations over a
set, the set is the <i>type</i> the operations are for.
</p>

<p>
One of those algebras we use in Haskell is Monoid.
</p>

<p>
<code>A monoid is a binary associative pattern with an identity.</code>
</p>

<p>
A monoid is a function that takes two arguments and follows two laws:
associativity and identity.
</p>

<ol class="org-ol">
<li>Associativity: arguments can be regrouped or paranthesised in
different orders and give the same result</li>
<li>Identity: there exists some value such that when it is passed as
input to the function, the operation is rendered moot and the other
value is returned. E.g. adding 0, multiplying by 1</li>
</ol>

<p>
Monoids are the pattern of summation, multiplication and list
concatenation, among other things.
</p>

<div class="org-src-container">
<pre class="src src-haskell">class Monoid m where
  mempty :: m
  mappend :: m -&gt; m -&gt; m
  mconcat :: [m] -&gt; m
  mconcat = foldr mappend mempty
</pre>
</div>

<p>
<code>mappend</code> is how any two values that inhabit the type can be joined
together. <code>mempty</code> is the identity value for that mappend operation.
</p>
</div>
<div id="outline-container-orge2ce7cc" class="outline-3">
<h3 id="orge2ce7cc"><span class="section-number-3">7.1</span> Examples of Monoids</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org285de14" class="outline-4">
<h4 id="org285de14"><span class="section-number-4">7.1.1</span> List</h4>
<div class="outline-text-4" id="text-7-1-1">
<div class="org-src-container">
<pre class="src src-haskell">mappend [1,2,3] [4,5,6]
-- [1,2,3,4,5,6]
mconcat [[1..3], [4..6]]
-- [1,2,3,4,5,6]
mappend "Trout" " goes well with garlic"
-- "Trout goes well with garlic"

instance Monoid [a] where
  mempty = []
  mappend = (++)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa3f88f" class="outline-4">
<h4 id="orgaa3f88f"><span class="section-number-4">7.1.2</span> Integers</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
Integers form a monoid under summation and multiplication. Because it
is unclear which rule is to be followed, there is no Monoid class
under Integer, but there is the <code>Sum</code> and <code>Product</code> types that signal
which Monoid instance is wanted.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf4f80e2" class="outline-3">
<h3 id="orgf4f80e2"><span class="section-number-3">7.2</span> Newtype</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Using <code>newtype</code> constrains the datatype to having a single unary data
constructor, and <code>newtype</code> guarantees no additional runtime overhead
in "wrapping" the original type. The runtime representation of newtype
and what it wraps are always identical.
</p>

<div class="org-src-container">
<pre class="src src-haskell">(&lt;&gt;) :: Monoid m =&gt; m -&gt; m -&gt; m
</pre>
</div>

<p>
<code>&lt;&gt;</code> is the infix version of <code>mappend</code>.
</p>

<p>
Monoid instances must abide by the following laws:
</p>

<div class="org-src-container">
<pre class="src src-haskell">-- left identity
mappend mempty x = x

-- right identity
mappend x mempty = x

-- associativity
mappend x (mappend y z) = mappend (mappend x y) z

mconcat = foldr mappend mempty
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7a4e07" class="outline-3">
<h3 id="orgb7a4e07"><span class="section-number-3">7.3</span> Monoid instances in <code>Bool</code></h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-haskell">All True &lt;&gt; All True
-- All {getAll = True}

All True &lt;&gt; All False
-- All {getAll = False}

Any True &lt;&gt; Any False
-- Any {getAny = True}

Any False &lt;&gt; Any False
-- Any {getAny = False}
</pre>
</div>

<p>
<code>All</code> represents boolean <i>conjuction</i>, while <code>Any</code> represents boolean disjunction.
</p>

<p>
For <code>Maybe</code>, <code>First</code> returns the "first" or leftmost non-Nothing
value. <code>Last</code> returns the "last" or rightmost non-Nothing value.
</p>

<div class="org-src-container">
<pre class="src src-haskell">(First (Just 1)) &lt;&gt; (First (Just 2))
-- First {getFirst = Just 1}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">instance Monoid b =&gt; Monoid (a -&gt; b)
instance (Monoid a, Monoid b) =&gt; Monoid (a,b)
instance (Monoid a, Monoid, b, Monoid c) =&gt; Monoid (a,b,c)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc84c57e" class="outline-2">
<h2 id="orgc84c57e"><span class="section-number-2">8</span> Semigroups</h2>
<div class="outline-text-2" id="text-8">
<p>
Semigroups are like monoids, but without the identity constraint. The
core operation remains binary and associative.
</p>

<div class="org-src-container">
<pre class="src src-haskell">class Semigroup a where
  (&lt;&gt;) :: a -&gt; a -&gt; a

(a &lt;&gt; b) &lt;&gt; c = a &lt;&gt; (b &lt;&gt; c)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">data NonEmpty a = a :| [a] deriving (Eq, Ord, Show)
</pre>
</div>
</div>
</div>
