html/haskell.html
<div id="outline-container-org4560249" class="outline-2">
<h2 id="org4560249"><span class="section-number-2">9</span> Functors</h2>
<div class="outline-text-2" id="text-9">
<p>
A functor is a way to apply a function over or around some structure
that we don't want to alter. That is, we want to apply the function to
the value that is "inside" some structure, and leave the structure
alone.
</p>

<p>
Intuitively, a <code>Functor</code> represents a "container" of some sort, along
with the ability to apply a function uniformly to every element in the
container. Another intuition of a Functor is that it represents some
sort of "computational context".
</p>

<p>
This is why functors are generally introduced by way of fmapping over
lists. No elements are removed or added, only transformed.
</p>

<p>
The typeclass <code>Functor</code> generalises this pattern, so that this basic
idea can be used across different structures.
</p>

<div class="org-src-container">
<pre class="src src-haskell">class Functor f where
  fmap :: (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>

<p>
The argument <code>f a</code> is a Functor <code>f</code> that takes a type argument <code>a</code>.
That is, the <code>f</code> is a type that has an instance of the Functor
typeclass.
</p>

<p>
The return value is <code>f b</code>. It is the same <code>f</code> from <code>f a</code>, while the
type argument b <i>possibly but not necessarily</i> refers to a different type.
</p>

<p>
<i>fmap</i> specialises to different types as such:
</p>
<div class="org-src-container">
<pre class="src src-haskell">fmap :: (a -&gt; b) -&gt; f a -&gt; f b
fmap :: (a -&gt; b) -&gt; [] a -&gt; [] b
fmap :: (a -&gt; b) -&gt; Maybe a -&gt; Maybe b
fmap :: (a -&gt; b) -&gt; Just a -&gt; Just b
fmap :: (a -&gt; b) -&gt; Either a -&gt; Either b
fmap :: (a -&gt; b) -&gt; (e,) a -&gt; (e,) b
fmap :: (a -&gt; b) -&gt; Identity a -&gt; Identity b
</pre>
</div>
</div>
<div id="outline-container-orgbe9fa88" class="outline-3">
<h3 id="orgbe9fa88"><span class="section-number-3">9.1</span> Functor Laws</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org5640b16" class="outline-4">
<h4 id="org5640b16"><span class="section-number-4">9.1.1</span> Identity</h4>
<div class="outline-text-4" id="text-9-1-1">
<div class="org-src-container">
<pre class="src src-haskell">fmap id == id
</pre>
</div>

<p>
If we fmap the identity function, it should have the same result as
passing our value to identity.
</p>
</div>
</div>
<div id="outline-container-org529bc99" class="outline-4">
<h4 id="org529bc99"><span class="section-number-4">9.1.2</span> Composition</h4>
<div class="outline-text-4" id="text-9-1-2">
<div class="org-src-container">
<pre class="src src-haskell">fmap (f . g) == fmap f . fmap g
</pre>
</div>
</div>
</div>
<div id="outline-container-orge96f034" class="outline-4">
<h4 id="orge96f034"><span class="section-number-4">9.1.3</span> Structure Preservation</h4>
<div class="outline-text-4" id="text-9-1-3">
<div class="org-src-container">
<pre class="src src-haskell">fmap :: Functor f =&gt; (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>

<p>
The <i>f</i> is constrained by the typeclass Functor, but that is all we
know about its type from this definition. Because the <i>f</i> persists
through the type of <code>fmap</code>, whatever the type is, we know it must be a
type that can take an argument, as in <code>f a</code> and <code>f b</code> and that it will
be the "structure" we're lifting the function over when we apply it to
the value inside.
</p>
</div>
</div>
</div>
<div id="outline-container-org191caad" class="outline-3">
<h3 id="org191caad"><span class="section-number-3">9.2</span> Examples</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-haskell">data WhoCares a =
  ItDoesnt
  | Matter a
  | WhatThisIsCalled
  deriving (Eq, Show)
</pre>
</div>

<p>
In the above datatype, only <code>Matter</code> can be <i>fmapped</i> over, because
the others are nullary, and there is no value to work with inside the
structure.
</p>

<p>
Here is a law-abiding instance of Functor.
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Functor WhoCares where
  fmap _ ItDoesnt = ItDoesnt
  fmap _ WhatThisIsCalled = WhatThisIsCalled
  fmap f (Matter a) = Matter (f a)
</pre>
</div>

<p>
This is a law-breaking instance:
</p>
<div class="org-src-container">
<pre class="src src-haskell">instance Functor WhoCares where
  fmap _ ItDoesnt = WhatThisIsCalled
  fmap f WhatThisIsCalled = ItDoesnt
  fmap f (Matter a) = Matter (f a)
</pre>
</div>

<p>
In this instance, the structure &#x2013; not the values wrapped or contained
within the structure &#x2013; change.
</p>
</div>
</div>
<div id="outline-container-org047aec0" class="outline-3">
<h3 id="org047aec0"><span class="section-number-3">9.3</span> Maybe and Either Functors</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-haskell">data Two a b = Two a b
</pre>
</div>

<p>
Notice <code>Two</code> has the kind <code>* -&gt; * -&gt; *</code>, however, functors are of kind
<code>* -&gt; *</code>, and hence functors on the type Two would be invalid. we can
reduce the kindness by doing the following:
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Functor (Two a) where
  fmap f (Two a b) = Two a (f b)
</pre>
</div>

<p>
Notice that we didn't apply <code>f</code> to <code>a</code>, because <code>a</code> is now part of the
Functor structure, and is untouchable.
</p>
</div>
</div>
<div id="outline-container-orgea53c46" class="outline-3">
<h3 id="orgea53c46"><span class="section-number-3">9.4</span> Ignoring possibilities</h3>
<div class="outline-text-3" id="text-9-4">
<p>
The Functor instances for the Maybe and Either datatypes are useful if
you tend to ignore the left cases, which are typically the error or
failure cases. Because fmap doesn't touch those cases, you can map
your function right to the values that you intend to work with and
ignore failure cases.
</p>
</div>
<div id="outline-container-org8aee1c1" class="outline-4">
<h4 id="org8aee1c1"><span class="section-number-4">9.4.1</span> Maybe</h4>
<div class="outline-text-4" id="text-9-4-1">
<div class="org-src-container">
<pre class="src src-haskell">incIfJust :: Num a =&gt; Maybe a -&gt; Maybe a
incIfJust (Just n) = Just $ n + 1
incIfJust Nothing = Nothing

incMaybe :: Num a =&gt; Maybe a -&gt; Maybe a
incMaybe = fmap (+1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgefbd212" class="outline-4">
<h4 id="orgefbd212"><span class="section-number-4">9.4.2</span> Either</h4>
<div class="outline-text-4" id="text-9-4-2">
<div class="org-src-container">
<pre class="src src-haskell">incIfRight :: Num a =&gt; Either e a =&gt; Either e a
incIfRight (Right n) = Right $ n + 1
incIfRight (Left e) = Left e

-- can be simplified to
incEither :: Num a =&gt; Either e a =&gt; Either e a
incEither = fmap (+1)
</pre>
</div>
</div>
</div>
</div>
