content/zettels/haskell.md


## Functors {#functors}

A functor is a way to apply a function over or around some structure
that we don't want to alter. That is, we want to apply the function to
the value that is "inside" some structure, and leave the structure
alone.

Intuitively, a `Functor` represents a "container" of some sort, along
with the ability to apply a function uniformly to every element in the
container. Another intuition of a Functor is that it represents some
sort of "computational context".

This is why functors are generally introduced by way of fmapping over
lists. No elements are removed or added, only transformed.

The typeclass `Functor` generalises this pattern, so that this basic
idea can be used across different structures.

```haskell
class Functor f where
  fmap :: (a -> b) -> f a -> f b
```

The argument `f a` is a Functor `f` that takes a type argument `a`.
That is, the `f` is a type that has an instance of the Functor
typeclass.

The return value is `f b`. It is the same `f` from `f a`, while the
type argument b _possibly but not necessarily_ refers to a different type.

_fmap_ specialises to different types as such:

```haskell
fmap :: (a -> b) -> f a -> f b
fmap :: (a -> b) -> [] a -> [] b
fmap :: (a -> b) -> Maybe a -> Maybe b
fmap :: (a -> b) -> Just a -> Just b
fmap :: (a -> b) -> Either a -> Either b
fmap :: (a -> b) -> (e,) a -> (e,) b
fmap :: (a -> b) -> Identity a -> Identity b
```


### Functor Laws {#functor-laws}


#### Identity {#identity}

```haskell
fmap id == id
```

If we fmap the identity function, it should have the same result as
passing our value to identity.


#### Composition {#composition}

```haskell
fmap (f . g) == fmap f . fmap g
```


#### Structure Preservation {#structure-preservation}

```haskell
fmap :: Functor f => (a -> b) -> f a -> f b
```

The _f_ is constrained by the typeclass Functor, but that is all we
know about its type from this definition. Because the _f_ persists
through the type of `fmap`, whatever the type is, we know it must be a
type that can take an argument, as in `f a` and `f b` and that it will
be the "structure" we're lifting the function over when we apply it to
the value inside.


### Examples {#examples}

```haskell
data WhoCares a =
  ItDoesnt
  | Matter a
  | WhatThisIsCalled
  deriving (Eq, Show)
```

In the above datatype, only `Matter` can be _fmapped_ over, because
the others are nullary, and there is no value to work with inside the
structure.

Here is a law-abiding instance of Functor.

```haskell
instance Functor WhoCares where
  fmap _ ItDoesnt = ItDoesnt
  fmap _ WhatThisIsCalled = WhatThisIsCalled
  fmap f (Matter a) = Matter (f a)
```

This is a law-breaking instance:

```haskell
instance Functor WhoCares where
  fmap _ ItDoesnt = WhatThisIsCalled
  fmap f WhatThisIsCalled = ItDoesnt
  fmap f (Matter a) = Matter (f a)
```

In this instance, the structure -- not the values wrapped or contained
within the structure -- change.


### Maybe and Either Functors {#maybe-and-either-functors}

```haskell
data Two a b = Two a b
```

Notice `Two` has the kind `* -> * -> *`, however, functors are of kind
`* -> *`, and hence functors on the type Two would be invalid. we can
reduce the kindness by doing the following:

```haskell
instance Functor (Two a) where
  fmap f (Two a b) = Two a (f b)
```

Notice that we didn't apply `f` to `a`, because `a` is now part of the
Functor structure, and is untouchable.


### Ignoring possibilities {#ignoring-possibilities}

The Functor instances for the Maybe and Either datatypes are useful if
you tend to ignore the left cases, which are typically the error or
failure cases. Because fmap doesn't touch those cases, you can map
your function right to the values that you intend to work with and
ignore failure cases.


#### Maybe {#maybe}

```haskell
incIfJust :: Num a => Maybe a -> Maybe a
incIfJust (Just n) = Just $ n + 1
incIfJust Nothing = Nothing

incMaybe :: Num a => Maybe a -> Maybe a
incMaybe = fmap (+1)
```


#### Either {#either}

```haskell
incIfRight :: Num a => Either e a => Either e a
incIfRight (Right n) = Right $ n + 1
incIfRight (Left e) = Left e

-- can be simplified to
incEither :: Num a => Either e a => Either e a
incEither = fmap (+1)
```
