html/haskell.html
<div id="outline-container-org2a546ba" class="outline-3">
<h3 id="org2a546ba"><span class="section-number-3">9.5</span> Summary</h3>
<div class="outline-text-3" id="text-9-5">
<p>
<code>Functor</code> is a mapping between categories. In Haskell, this manifests
as a typeclass which lifts a function between to types over two new
types. This conventionally implies some notion of a function which can
be applied to a value with more structure than the unlifted function
was originally designed for. The additional structure is represented
by the use of a higher kinded type <i>f</i>, introduced by the definition
of the Functor typeclass.
</p>

<p>
To <i>lift over</i>, and later in Monad, to <i>bind over</i>, is a metaphor. One
way to think about it is that we can lift a function into a context.
Another is that we lift a function over some layer of structure to
apply it.
</p>

<div class="org-src-container">
<pre class="src src-haskell">fmap (+1) $ Just 1 -- Just 2
fmap (+1) [1,2,3] -- [2,3,4]
</pre>
</div>

<p>
In both cases, the function we're lifting is the same. In the first
case, we lift that function into a Maybe context in order to apply it,
in the second case, into a list context.
</p>

<p>
The context determines how the function will get applied: the context
is the datatype, the definition of the datatype, and the Functor
instance we have for that datatype.
</p>
</div>
</div>
</div>
<div id="outline-container-org02d3c29" class="outline-2">
<h2 id="org02d3c29"><span class="section-number-2">10</span> Applicative</h2>
<div class="outline-text-2" id="text-10">
<p>
Monoid gives us a means of hashing two values of the same type
together.
</p>

<p>
Functor is for function application over some structure we don't want
to have to think about.
</p>

<p>
The Applicative typeclass is a Monoidal Functor. The Applicative
typeclass allows for function application lifted over structure (like
Functor). But with Applicative the function we're applying is also
embedded in some structure. Because the function and the value it's
being applied to both have structure, we have to smash those
structures together.
</p>

<div class="org-src-container">
<pre class="src src-haskell">class Functor f =&gt; Applicative f where
  pure :: a -&gt; f a
  (&lt;*&gt;) :: f (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>
<p>
The <code>pure</code> function embeds something into functorial (applicative)
structure.
</p>

<p>
<code>&lt;*&gt;</code> is an infix operation called 'apply'. This is very similar to
the types of fmap.
</p>

<div class="org-src-container">
<pre class="src src-haskell">-- fmap
(&lt;$&gt;) :: Functor f =&gt; (a -&gt; b) -&gt; f a -&gt; f b
(&lt;*&gt;) :: Applicative f =&gt; f (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>

<p>
the Control.Applicative library provides some convenience functions:
<code>liftA</code>, <code>liftA2</code> and <code>liftA3</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">liftA :: Applicative f =&gt; (a -&gt; b) -&gt; f a -&gt; f b
liftA2 :: Appplicative f =&gt; (a -&gt; b -&gt; c) -&gt; f a -&gt; f b -&gt; f c
liftA2 :: Appplicative f =&gt; (a -&gt; b -&gt; c -&gt; d) -&gt; f a -&gt; f b -&gt; f c -&gt; f d
</pre>
</div>

<p>
<code>liftA</code> is just <code>fmap</code> with an Applicative typeclass constraint as
opposed to a Functor typeclass constraint.
</p>

<p>
In <code>pure</code>, the left type is handled differently from the right:
</p>
<div class="org-src-container">
<pre class="src src-haskell">pure 1 :: ([a], Int) -- ([], 1)
pure 1 :: Either a Int -- Right 1
</pre>
</div>

<p>
The left type is part of the structure, and the structure is not
transformed by the function application.
</p>

<p>
In a sense, Applicative is Monoid bolted onto a Functor to be able to
deal with functions embedded in additional structure. In another,
we're enriching function application with the very structure we were
previously merely mapping over with Functor.
</p>

<div class="org-src-container">
<pre class="src src-haskell">[(*2), (*3)] &lt;*&gt; [4,5] -- [2*4, 2*5, 3*4, 3*5]
= [8,10,12,15]
</pre>
</div>

<p>
<code>&lt;*&gt;</code> takes a functor that has a function in it, and another functor
and applies the function inside the functor. <code>&lt;*&gt;</code> is left associative.
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Applicative Maybe where
  pure = Just
  Nothing &lt;*&gt; _ = Nothing
  (Just f) &lt;*&gt; something = fmap f something
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">instance Applicative [] where
  pure x = [x]
  fs &lt;*&gt; xs = [f x | f &lt;- fs, x &lt;- xs]
</pre>
</div>
</div>
</div>
