content/zettels/haskell.md


### Summary {#summary}

`Functor` is a mapping between categories. In Haskell, this manifests
as a typeclass which lifts a function between to types over two new
types. This conventionally implies some notion of a function which can
be applied to a value with more structure than the unlifted function
was originally designed for. The additional structure is represented
by the use of a higher kinded type _f_, introduced by the definition
of the Functor typeclass.

To _lift over_, and later in Monad, to _bind over_, is a metaphor. One
way to think about it is that we can lift a function into a context.
Another is that we lift a function over some layer of structure to
apply it.

```haskell
fmap (+1) $ Just 1 -- Just 2
fmap (+1) [1,2,3] -- [2,3,4]
```

In both cases, the function we're lifting is the same. In the first
case, we lift that function into a Maybe context in order to apply it,
in the second case, into a list context.

The context determines how the function will get applied: the context
is the datatype, the definition of the datatype, and the Functor
instance we have for that datatype.


## Applicative {#applicative}

Monoid gives us a means of hashing two values of the same type
together.

Functor is for function application over some structure we don't want
to have to think about.

The Applicative typeclass is a Monoidal Functor. The Applicative
typeclass allows for function application lifted over structure (like
Functor). But with Applicative the function we're applying is also
embedded in some structure. Because the function and the value it's
being applied to both have structure, we have to smash those
structures together.

```haskell
class Functor f => Applicative f where
  pure :: a -> f a
  (<*>) :: f (a -> b) -> f a -> f b
```

The `pure` function embeds something into functorial (applicative)
structure.

`<*>` is an infix operation called 'apply'. This is very similar to
the types of fmap.

```haskell
-- fmap
(<$>) :: Functor f => (a -> b) -> f a -> f b
(<*>) :: Applicative f => f (a -> b) -> f a -> f b
```

the Control.Applicative library provides some convenience functions:
`liftA`, `liftA2` and `liftA3`:

```haskell
liftA :: Applicative f => (a -> b) -> f a -> f b
liftA2 :: Appplicative f => (a -> b -> c) -> f a -> f b -> f c
liftA2 :: Appplicative f => (a -> b -> c -> d) -> f a -> f b -> f c -> f d
```

`liftA` is just `fmap` with an Applicative typeclass constraint as
opposed to a Functor typeclass constraint.

In `pure`, the left type is handled differently from the right:

```haskell
pure 1 :: ([a], Int) -- ([], 1)
pure 1 :: Either a Int -- Right 1
```

The left type is part of the structure, and the structure is not
transformed by the function application.

In a sense, Applicative is Monoid bolted onto a Functor to be able to
deal with functions embedded in additional structure. In another,
we're enriching function application with the very structure we were
previously merely mapping over with Functor.

```haskell
[(*2), (*3)] <*> [4,5] -- [2*4, 2*5, 3*4, 3*5]
= [8,10,12,15]
```

`<*>` takes a functor that has a function in it, and another functor
and applies the function inside the functor. `<*>` is left associative.

```haskell
instance Applicative Maybe where
  pure = Just
  Nothing <*> _ = Nothing
  (Just f) <*> something = fmap f something
```

```haskell
instance Applicative [] where
  pure x = [x]
  fs <*> xs = [f x | f <- fs, x <- xs]
```
