haskell.org
* Monads
Monads are a natural extension to applicative functors. If you have a
value with a context =m a=, how do you apply to it a function that
takes a normal a and returns a value with a context?

#+BEGIN_SRC haskell
  (>>=) :: (Monad m) => m a -> (a -> m b) -> m b
#+END_SRC

In Prelude, =IO=, lists, and =Maybe= are members of the monadic
classes.

#+BEGIN_SRC haskell
  -- infixl 1 >>=, >>
  class Applicative m => Monad (m :: * -> *) where
    (>>=) :: m a -> (a -> m b) -> m b
    (>>) :: m a -> m b -> m b
    return :: a -> m a
    fail :: String -> m a 
#+END_SRC

=>>=, referred, to as bind, combines a Monad containing values of type
=a=, and a function which operates on =a= and returns a monad of type
=b=.

=>>=, also sometimes called /Mr. Pointy/, is used when the function
does not need the value of the first Monadic operator.

The precise meaning of bind depends on the monad. For example, in the
=IO= monad, =x>>=y= performs two actions sequentially, passing the
result of the first into the second. For the lists and =Maybe= type,
these monadic operations can be understood in terms of passing zero or
more values from one calculation to the next.

The =do= syntax provides a simple shorthand for chains of monadic
operations:

#+BEGIN_SRC haskell
  do e1 ; e2 = e1 >> e2
  do p <- e1; e2 = e1 >>= (\v -> case v of p -> e2; _ -> fail "s")
#+END_SRC

The laws which govern =>>== and =return= are:

#+BEGIN_SRC haskell
  return a >>= k          = k a
  m >>= return            = m
  xs >>= return . f       = fmap f xs
  m >>= (\x -> k x >>= h) = (m >>= k) >>= h
#+END_SRC
** Built in Monads
*** Maybe
#+BEGIN_SRC haskell
  -- treating Maybe as unctors
  fmap (++"!") (Just "wisdom") -- Just "wisdom!"
  fmap (++"!") Nothing -- Nothing

  -- treating Maybe as Applicatives
  Just (+3) <*> Just 3 -- Just 6
  Nothing <*> Just "greed" -- Nothing
  max <$> Just 3 <*> Just 6 -- Just 6
  max <$> Just 3 <*> Nothing -- Nothing

  -- Upgrading to Monads
  (\x -> Just (x + 1)) 1 -- Just 2
  applyMaybe :: Maybe a -> (a -> Maybe b) -> Maybe b
  applyMaybe Nothing f = Nothing
  applyMaybe (Just x) f = f x

  Just 3 `applyMaybe` \x -> Just (x + 1) -- Just 4
  Nothing `applyMaybe` \x -> Just (x + 1) -- Nothing

  -- applyMaybe is >>= for the Maybe monad
#+END_SRC
*** Lists
The monadic aspects of lists bring non-determinism into code in a
clear and readable manner.

#+BEGIN_SRC haskell
  instance Monad [] where
    return x = [x]
    xs >>= f = concat (map f xs)
    fail _ = []
#+END_SRC

#+BEGIN_SRC haskell
  [3,4,5] >> = \x -> [x, -x]
  -- [3, -3, 4, -4, 5, -5]
#+END_SRC

Non-determinism also includes support for failure. Here, the empty
list =[]= is the equivalent of =Nothing=, because it signifies the
absence of a result.

Just like with =Maybe= values, we can chain several lists with =>>==:

#+BEGIN_SRC haskell
  [1,2] >>= \n -> ['a', 'b'] >>= \ch -> return (n,ch)
  -- [(1, 'a'), (1, 'b'), (2, 'a'), (2, 'b')]

  do
    n <- [1,2]
    ch <- ['a', 'b']
    return (n,ch)
#+END_SRC

The list =[1,2]= gets bound to n, and =["a", "b"]= gets bound to ch.
=return (n,ch)=, takes the tuple, and makes the smallest possible list
that still presents (n,ch) as the result.

For lists, monadic binding involves joining together a set of
calculations for each value in the list. When used with lists, the
signature of =>>== becomes:

#+BEGIN_SRC haskell
  (>>=) :: [a] -> (a -> [b]) -> [b] 
#+END_SRC

Given a list of =a='s and a function that maps an a onto a list of
=b='s, =>>== applies this function to each of the =a='s in the input
and returns the generated =b='s concatenated into a list. The return
function creates a singleton list.

The following two expressions are equivalent:
#+BEGIN_SRC haskell
  [(x,y) | x <- [1,2,3] , y <- [1,2,3], x /= y]

  do x <- [1,2,3]
     y <- [1,2,3]
     True <- return (x /= y)
     return (x,y)
#+END_SRC
