html/haskell.html
<div id="outline-container-orgf33a329" class="outline-2">
<h2 id="orgf33a329"><span class="section-number-2">11</span> Monads</h2>
<div class="outline-text-2" id="text-11">
<p>
Monads are a natural extension to applicative functors. If you have a
value with a context <code>m a</code>, how do you apply to it a function that
takes a normal a and returns a value with a context?
</p>

<div class="org-src-container">
<pre class="src src-haskell">(&gt;&gt;=) :: (Monad m) =&gt; m a -&gt; (a -&gt; m b) -&gt; m b
</pre>
</div>

<p>
In Prelude, <code>IO</code>, lists, and <code>Maybe</code> are members of the monadic
classes.
</p>

<div class="org-src-container">
<pre class="src src-haskell">-- infixl 1 &gt;&gt;=, &gt;&gt;
class Applicative m =&gt; Monad (m :: * -&gt; *) where
  (&gt;&gt;=) :: m a -&gt; (a -&gt; m b) -&gt; m b
  (&gt;&gt;) :: m a -&gt; m b -&gt; m b
  return :: a -&gt; m a
  fail :: String -&gt; m a 
</pre>
</div>

<p>
<code>&gt;&gt;</code>, referred, to as bind, combines a Monad containing values of type
<code>a</code>, and a function which operates on <code>a</code> and returns a monad of type
<code>b</code>.
</p>

<p>
<code>&gt;&gt;</code>, also sometimes called <i>Mr. Pointy</i>, is used when the function
does not need the value of the first Monadic operator.
</p>

<p>
The precise meaning of bind depends on the monad. For example, in the
<code>IO</code> monad, <code>x&gt;&gt;=y</code> performs two actions sequentially, passing the
result of the first into the second. For the lists and <code>Maybe</code> type,
these monadic operations can be understood in terms of passing zero or
more values from one calculation to the next.
</p>

<p>
The <code>do</code> syntax provides a simple shorthand for chains of monadic
operations:
</p>

<div class="org-src-container">
<pre class="src src-haskell">do e1 ; e2 = e1 &gt;&gt; e2
do p &lt;- e1; e2 = e1 &gt;&gt;= (\v -&gt; case v of p -&gt; e2; _ -&gt; fail "s")
</pre>
</div>

<p>
The laws which govern <code>&gt;&gt;=</code> and <code>return</code> are:
</p>

<div class="org-src-container">
<pre class="src src-haskell">return a &gt;&gt;= k          = k a
m &gt;&gt;= return            = m
xs &gt;&gt;= return . f       = fmap f xs
m &gt;&gt;= (\x -&gt; k x &gt;&gt;= h) = (m &gt;&gt;= k) &gt;&gt;= h
</pre>
</div>
</div>
<div id="outline-container-orga01a315" class="outline-3">
<h3 id="orga01a315"><span class="section-number-3">11.1</span> Built in Monads</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-orgb877de7" class="outline-4">
<h4 id="orgb877de7"><span class="section-number-4">11.1.1</span> Maybe</h4>
<div class="outline-text-4" id="text-11-1-1">
<div class="org-src-container">
<pre class="src src-haskell">-- treating Maybe as unctors
fmap (++"!") (Just "wisdom") -- Just "wisdom!"
fmap (++"!") Nothing -- Nothing

-- treating Maybe as Applicatives
Just (+3) &lt;*&gt; Just 3 -- Just 6
Nothing &lt;*&gt; Just "greed" -- Nothing
max &lt;$&gt; Just 3 &lt;*&gt; Just 6 -- Just 6
max &lt;$&gt; Just 3 &lt;*&gt; Nothing -- Nothing

-- Upgrading to Monads
(\x -&gt; Just (x + 1)) 1 -- Just 2
applyMaybe :: Maybe a -&gt; (a -&gt; Maybe b) -&gt; Maybe b
applyMaybe Nothing f = Nothing
applyMaybe (Just x) f = f x

Just 3 `applyMaybe` \x -&gt; Just (x + 1) -- Just 4
Nothing `applyMaybe` \x -&gt; Just (x + 1) -- Nothing

-- applyMaybe is &gt;&gt;= for the Maybe monad
</pre>
</div>
</div>
</div>
<div id="outline-container-orgda3a81d" class="outline-4">
<h4 id="orgda3a81d"><span class="section-number-4">11.1.2</span> Lists</h4>
<div class="outline-text-4" id="text-11-1-2">
<p>
The monadic aspects of lists bring non-determinism into code in a
clear and readable manner.
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Monad [] where
  return x = [x]
  xs &gt;&gt;= f = concat (map f xs)
  fail _ = []
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">[3,4,5] &gt;&gt; = \x -&gt; [x, -x]
-- [3, -3, 4, -4, 5, -5]
</pre>
</div>

<p>
Non-determinism also includes support for failure. Here, the empty
list <code>[]</code> is the equivalent of <code>Nothing</code>, because it signifies the
absence of a result.
</p>

<p>
Just like with <code>Maybe</code> values, we can chain several lists with <code>&gt;&gt;=</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">[1,2] &gt;&gt;= \n -&gt; ['a', 'b'] &gt;&gt;= \ch -&gt; return (n,ch)
-- [(1, 'a'), (1, 'b'), (2, 'a'), (2, 'b')]

do
  n &lt;- [1,2]
  ch &lt;- ['a', 'b']
  return (n,ch)
</pre>
</div>

<p>
The list <code>[1,2]</code> gets bound to n, and <code>["a", "b"]</code> gets bound to ch.
<code>return (n,ch)</code>, takes the tuple, and makes the smallest possible list
that still presents (n,ch) as the result.
</p>

<p>
For lists, monadic binding involves joining together a set of
calculations for each value in the list. When used with lists, the
signature of <code>&gt;&gt;=</code> becomes:
</p>

<div class="org-src-container">
<pre class="src src-haskell">(&gt;&gt;=) :: [a] -&gt; (a -&gt; [b]) -&gt; [b] 
</pre>
</div>

<p>
Given a list of <code>a</code>'s and a function that maps an a onto a list of
<code>b</code>'s, <code>&gt;&gt;=</code> applies this function to each of the <code>a</code>'s in the input
and returns the generated <code>b</code>'s concatenated into a list. The return
function creates a singleton list.
</p>

<p>
The following two expressions are equivalent:
</p>
<div class="org-src-container">
<pre class="src src-haskell">[(x,y) | x &lt;- [1,2,3] , y &lt;- [1,2,3], x /= y]

do x &lt;- [1,2,3]
   y &lt;- [1,2,3]
   True &lt;- return (x /= y)
   return (x,y)
</pre>
</div>
</div>
</div>
</div>
