haskell.org
** Using Monads
We first analyse this state monad, built around a state type =s= that
looks like this:

#+BEGIN_SRC haskell
  data SM a = SM (S -> (a, S)) -- The monadic type

  instance Monad SM where
    -- defines state propogation
    SM c1 >>= fc2 = SM (\s0 -> let (r, s1) = c1 s0
                                   SM c2 = fc2 r
                               in
                                 c2 s1)
    return k = SM (\s -> (k, s))

  -- extracts the state from the Monad
  readSM :: SM S
  readSM = SM (\s -> (s, s))

  -- updates the state of the monad
  updateSM :: (S -> S) -> SM () -- alters the state
  updateSM f = SM (\s -> ((), f s))

  -- run a computation in the SM monad
  runSM :: S -> SM a -> (a, S)
  runSM s0 (SM c) = c s0
#+END_SRC

=SM= is defined to be a computation that implicitly carries a type
=s=. =SM= consists of functions that take a state and produce two
results: a returned value (of any type) and an updated state.

The instance declaration defines the 'plumbing' of the monad: how to
sequence two computations and the definition of an empty computation.

Sequencing (=>>==) defines a computation (denoted by the constructor
=SM=) that passes the initial state, =s0= into =c1=, then passes the
value coming out of this computation, =r=, to the function that
returns the second computation, =c2=. Finally, the state coming out of
=c1= is passed into =c2= and the overall result is the result of =c2=.

Here =return= doesn't change the state at all; it only serves to
bring a value into the monad.

=readSM= brings the state out of the monad for observation while
=updateSM= allows the user to alter the state in the monad.

* Do Notation
Haskell's do notation supports an imperative style of programming by
providing syntactic sugar for chains of monadic expressions.

#+BEGIN_SRC haskell
  a >>= \x ->
  b >>
  c >>= \y ->
  d

  -- becomes:

  do { x <- a
     ;      b
     ; y <- c
     ;      d
     }
#+END_SRC

#+BEGIN_SRC haskell
  do e → e
  do { e; stmts } → e >> do { stmts }
  do { v <- e; stmts } → e >>= \v -> do { stmts }
  do { let decls; stmts} → let decls in do { stmts }
#+END_SRC

#+BEGIN_SRC haskell
  routine :: Maybe Pole
  routine = do
    start <- return (0,0)
    first <- landLeft 2 start
    second <- landRight 2 first
    landLeft 1 second
#+END_SRC

