html/haskell.html
<div id="outline-container-org4fb2da4" class="outline-3">
<h3 id="org4fb2da4"><span class="section-number-3">11.2</span> Using Monads</h3>
<div class="outline-text-3" id="text-11-2">
<p>
We first analyse this state monad, built around a state type <code>s</code> that
looks like this:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data SM a = SM (S -&gt; (a, S)) -- The monadic type

instance Monad SM where
  -- defines state propogation
  SM c1 &gt;&gt;= fc2 = SM (\s0 -&gt; let (r, s1) = c1 s0
                                 SM c2 = fc2 r
                             in
                               c2 s1)
  return k = SM (\s -&gt; (k, s))

-- extracts the state from the Monad
readSM :: SM S
readSM = SM (\s -&gt; (s, s))

-- updates the state of the monad
updateSM :: (S -&gt; S) -&gt; SM () -- alters the state
updateSM f = SM (\s -&gt; ((), f s))

-- run a computation in the SM monad
runSM :: S -&gt; SM a -&gt; (a, S)
runSM s0 (SM c) = c s0
</pre>
</div>

<p>
<code>SM</code> is defined to be a computation that implicitly carries a type
<code>s</code>. <code>SM</code> consists of functions that take a state and produce two
results: a returned value (of any type) and an updated state.
</p>

<p>
The instance declaration defines the 'plumbing' of the monad: how to
sequence two computations and the definition of an empty computation.
</p>

<p>
Sequencing (<code>&gt;&gt;=</code>) defines a computation (denoted by the constructor
<code>SM</code>) that passes the initial state, <code>s0</code> into <code>c1</code>, then passes the
value coming out of this computation, <code>r</code>, to the function that
returns the second computation, <code>c2</code>. Finally, the state coming out of
<code>c1</code> is passed into <code>c2</code> and the overall result is the result of <code>c2</code>.
</p>

<p>
Here <code>return</code> doesn't change the state at all; it only serves to
bring a value into the monad.
</p>

<p>
<code>readSM</code> brings the state out of the monad for observation while
<code>updateSM</code> allows the user to alter the state in the monad.
</p>
</div>
</div>
</div>

<div id="outline-container-org1eafbbe" class="outline-2">
<h2 id="org1eafbbe"><span class="section-number-2">12</span> Do Notation</h2>
<div class="outline-text-2" id="text-12">
<p>
Haskell's do notation supports an imperative style of programming by
providing syntactic sugar for chains of monadic expressions.
</p>

<div class="org-src-container">
<pre class="src src-haskell">a &gt;&gt;= \x -&gt;
b &gt;&gt;
c &gt;&gt;= \y -&gt;
d

-- becomes:

do { x &lt;- a
   ;      b
   ; y &lt;- c
   ;      d
   }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">do e  e
do { e; stmts }  e &gt;&gt; do { stmts }
do { v &lt;- e; stmts }  e &gt;&gt;= \v -&gt; do { stmts }
do { let decls; stmts}  let decls in do { stmts }
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">routine :: Maybe Pole
routine = do
  start &lt;- return (0,0)
  first &lt;- landLeft 2 start
  second &lt;- landRight 2 first
  landLeft 1 second
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2017-12-02 Sat 22:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
